package chapter_06;

import java.util.Scanner;

/*Вложени цикли 
for (initialization; test; update) { 
  for (initialization; test; update) {
         statements;
  }
...   }
Вложените цикли представляват конструкция от няколко цикъла един в друг. Най-вътрешния цикъл се изпълнява най-много пъти. 
В примерната конструкция по долу ще разгледаме пример за вложен цикъл. След инициализация на първия for цикъл ще започне
да се изпълнява втория. Ще се инициализира променливата му, ще се провери условието и ще се изпълнят изразите в него, 
след което ще се обнови променливата и ще продължи изпълнението на този цикъл, докато условието му не върне false.
В този случай ще се върне в първия for цикъл, ще се извърши обновяване на неговата променлива и отново ще бъде 
изпълнен целия втори цикъл. Обикновено 2 for цикъла се използват за манипулация на двумерни масиви. 
Вложените цикли, използвани необмислено, могат да влошат производителността на програмата.
*/
/*Отпечатване на триъгълник – пример
Нека си поставим следната задача: по дадено число n да отпечатаме на конзолата триъгълник с n на брой реда*/

public class PrintTriangle {
	public static void main(String[]args){
		Scanner sc = new Scanner(System.in);
		System.out.print("Please enter n= ");
		int n = sc.nextInt();
		
		for(int row=1; row<=n; row++){
			for(int col=1; col<=row; col++){
				System.out.print(col);
			}
			System.out.println();
		}
	}
	
      
}
